<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>DrasTTica.com</title>
<style type="text/css">
<!--
body {
	background-color: #000;
}
.Estilo1 {	font-size: 24px;
	color: #6b0303;
}
-->
</style></head>

<body>
<p align="center">
<img src="Imagenes Web/Desplegable.gif" alt="" name="Desplegable" width="900" height="60" border="0" usemap="#m_Desplegable" id="Desplegable" />
  <map name="m_Desplegable" id="m_Desplegable">
    <area shape="rect" coords="829,31,889,54" href="Home.htm" target="_self" alt="" />
    <area shape="rect" coords="708,32,788,54" href="mailto:drasttica@drasttica.com" alt="" />
    <area shape="rect" coords="626,34,681,54" href="Libro.htm" target="_self" alt="" />
    <area shape="rect" coords="216,32,281,54" href="Fotos.htm" alt="" />
    <area shape="rect" coords="106,34,183,53" href="Miembros.htm" alt="" />
    <area shape="rect" coords="7,34,79,54" href="Noticias.htm" alt="" />
  </map>
</p>
<p style="font-family: Verdana, Arial, sans-serif; font-size: 11px; margin-top: 2px;">
<a href="Noticias.htm" style="color:#666;">Noticias</a> &middot; <a href="Conciertos.htm" style="color:#666;">Conciertos</a> &middot; <a href="Miembros.htm" style="color:#666;">Miembros</a> &middot; <a href="Historia.htm" style="color:#666;">Historia</a> &middot; <a href="Fotos.htm" style="color:#666;">Fotos</a> &middot; <a href="Videos.htm" style="color:#666;">Videos</a> &middot; <a href="Audio.htm" style="color:#666;">Audio</a> &middot; <a href="Multimedia.htm" style="color:#666;">Multimedia</a> &middot; <a href="Libro.htm" style="color:#666;">Libro</a> &middot; <a href="mailto:drasttica@drasttica.com" style="color:#666;">Contacto</a> &middot; <a href="Home.htm" style="color:#666;">Home</a>
</p>
<p align="center">&nbsp;</p>
<p align="center" class="Estilo1"><em><strong><img src="Imagenes Web/Cabecera historia.jpg" alt="" width="900" height="54" /></strong></em></p>
<p align="left">Drasttica surge de las cenizas de Mistica nacida en 2002 y de la que s&oacute;lo quedan hoy en d&iacute;a Jawy y Luis &Aacute;ngel. </p>
<p align="left">Mistica en un principio estaba pensada para versionar temas de grupos de rock-heavy y power-metal tales como Gamma Ray o Stratovarius. Tras idas y venidas y la grabaci&oacute;n de un video clip muy cachondo del tema “send me a sign” de Gamma Ray, el grupo se desgran&oacute; quedando solo en &eacute;l Wah-wah, Jawy y Luis &Aacute;ngel a la espera de la llegada de nuevos m&uacute;sicos. </p>
<p align="left">En 2004, en una fr&iacute;a ma&ntilde;ana de enero se uni&oacute; al grupo V&iacute;ctor (proveniente de Akratos) para darle un toque &uacute;nico a la banda con sus riffs y su potencia. </p>
<p align="left">Poco mas tarde Wah-wah, guitarrista principal de Mistica, deja la banda para darle un vuelco mas profesional a su carrera y, a trav&eacute;s de la academia “Twenty Century”, Wah-wah recomienda a Luis (actual guitarrista de Drasttica). </p>
<p align="left">A partir de entonces Luis le dio al sonido de la banda el toque Thrash que hoy en parte les caracteriza, quedando una mezcla Heavy-Trash a partes iguales. </p>
<p align="left">Pero no es realmente hasta diciembre de 2004 con el pretexto en parte de tocar en directo en fiestas privadas (cumplea&ntilde;os y dem&aacute;s) cuando llega Pepe (vocalista actual de Drasttica), proveniente de grupos como Farsalia, Aftermath y de los archiconocidos Today End Dying, completando as&iacute; la actual formaci&oacute;n. </p>
<p align="left">El nombre y el nuevo lavado de cara llega en Abril de 2005 al t&eacute;rmino de una de esas fiestas privadas en la que por entonces Mistica se convierte en Drasttica empezando a componer su propia m&uacute;sica y a tocarla en directo. </p>
<p align="left">Actualmente Drasttica ha tocado en festivales y salas madrile&ntilde;as (como Taboo y Trilogy) y est&aacute; completando su primera maqueta a la vista de nuevos conciertos y festivales en el que poder demostrar todo su talento y su potencia. </p>
<p align="center" class="Estilo1"><img src="Imagenes Web/img Historia.jpg" alt="" width="381" height="289" align="middle" /></p>
</body>
</html>
